ANECDOTES = [
    """Программист звонит в библиотеку.
— Здравствуйте, Катю можно?
— Она в архиве.
— Разархивируйте ее пожалуйста. Она мне срочно нужна!
""",

    """— Настоящий программист всегда должен ложиться спать или в 1:28 или в 2:56... Ну, на крайний случай, в 5:12.
— А вставать в 10:24. Ну, на крайний случай, в 20:48.
""",

    """Работа программиста и шамана имеет много общего — оба бормочут непонятные слова, совершают непонятные действия и не могут объяснить, как оно работает.""",

    """Программист после напряженного трудового дня залезает в холодильник, достает пачку масла, читает на обертке:
— Масло сливочное. 72%. В голове быстрая мысль:
— О! Скоро загрузится! Возвращает масло в холодильник. Закрывает дверцу.
""",

    """Никогда не выявляйте в программе ошибки, если не знаете, что с ними дальше делать.""",

    ##
    ## Чтобы добавить новый анекдот, напишите:
    ##
    ## """текст анекдота""",
    ##
]
